app/controllers/artists_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @artist = Artist.find(params[:id])